Revit 2026 API

# BasicLossFactor(BasicLossFactor) Constructor

---

Creates a copy of the given basic loss factor object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BasicLossFactor(
	BasicLossFactor other
)
```
```vb
Public Sub New (
	other As BasicLossFactor
)
```
```cpp
public:
BasicLossFactor(
	BasicLossFactor^ other
)
```
```fsharp
new :
        other : BasicLossFactor -> BasicLossFactor
```

#### Parameters

other BasicLossFactor

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

BasicLossFactor Class

BasicLossFactor Overload

Autodesk.Revit.DB.Lighting Namespace